### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_vpc.add[0] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[1] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[3] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[4] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[5] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[6] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[7] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[8] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[9] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[10] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[11] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[12] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[13] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[14] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[15] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[16] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[17] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[19] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[20] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[21] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[24] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[25] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[27] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[28] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[29] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[30] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[32] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[33] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[35] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[36] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[37] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[38] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[39] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[40] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[41] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[42] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[44] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[45] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[48] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

  # aws_vpc.add[49] will be created
+   resource "aws_vpc" "add" {
+       arn                            = (known after apply)
+       cidr_block                     = "10.0.0.0/16"
+       default_network_acl_id         = (known after apply)
+       default_route_table_id         = (known after apply)
+       default_security_group_id      = (known after apply)
+       dhcp_options_id                = (known after apply)
+       enable_classiclink             = (known after apply)
+       enable_classiclink_dns_support = (known after apply)
+       enable_dns_hostnames           = (known after apply)
+       enable_dns_support             = true
+       id                             = (known after apply)
+       instance_tenancy               = "default"
+       ipv6_association_id            = (known after apply)
+       ipv6_cidr_block                = (known after apply)
+       main_route_table_id            = (known after apply)
+       owner_id                       = (known after apply)
+       tags                           = {
+           "Name" = "vpc-handson-add"
        }
+       tags_all                       = {
+           "Name" = "vpc-handson-add"
        }
    }

Plan: 40 to add, 0 to change, 0 to destroy.
```
</details>